benchmark/go-frameworks/results/20260924-102750/results/get/stdlib/r2/20000.txt
Running 40s test @ http://10.128.0.4:8081/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 0.899ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.909ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.911ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.918ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.909ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.900ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.188ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.913ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.905ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.900ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.899ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.899ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.223ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.898ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 0.945ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.062ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     0.95ms  460.92us   7.83ms   69.18%
    Req/Sec     1.33k   679.89     3.56k    83.49%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    0.93ms
 75.000%    1.23ms
 90.000%    1.51ms
 99.000%    2.10ms
 99.900%    3.77ms
 99.990%    5.22ms
 99.999%    6.33ms
100.000%    7.84ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.100     0.000000            1         1.00
       0.369     0.100000        59687         1.11
       0.529     0.200000       119675         1.25
       0.668     0.300000       179274         1.43
       0.801     0.400000       238993         1.67
       0.929     0.500000       298614         2.00
       0.990     0.550000       328395         2.22
       1.051     0.600000       358470         2.50
       1.110     0.650000       387991         2.86
       1.170     0.700000       417896         3.33
       1.233     0.750000       448033         4.00
       1.267     0.775000       462564         4.44
       1.303     0.800000       477484         5.00
       1.342     0.825000       492526         5.71
       1.385     0.850000       507414         6.67
       1.439     0.875000       522231         8.00
       1.472     0.887500       529732         8.89
       1.507     0.900000       537172        10.00
       1.546     0.912500       544711        11.43
       1.589     0.925000       552164        13.33
       1.638     0.937500       559603        16.00
       1.666     0.943750       563360        17.78
       1.695     0.950000       567029        20.00
       1.728     0.956250       570753        22.86
       1.766     0.962500       574510        26.67
       1.811     0.968750       578188        32.00
       1.838     0.971875       580078        35.56
       1.867     0.975000       581971        40.00
       1.898     0.978125       583786        45.71
       1.935     0.981250       585669        53.33
       1.979     0.984375       587512        64.00
       2.005     0.985938       588459        71.11
       2.037     0.987500       589371        80.00
       2.073     0.989062       590317        91.43
       2.123     0.990625       591252       106.67
       2.205     0.992188       592181       128.00
       2.271     0.992969       592639       142.22
       2.365     0.993750       593104       160.00
       2.465     0.994531       593573       182.86
       2.591     0.995313       594035       213.33
       2.745     0.996094       594506       256.00
       2.833     0.996484       594732       284.44
       2.927     0.996875       594968       320.00
       3.031     0.997266       595200       365.71
       3.145     0.997656       595434       426.67
       3.275     0.998047       595664       512.00
       3.357     0.998242       595781       568.89
       3.443     0.998437       595897       640.00
       3.559     0.998633       596014       731.43
       3.675     0.998828       596130       853.33
       3.785     0.999023       596247      1024.00
       3.851     0.999121       596306      1137.78
       3.913     0.999219       596366      1280.00
       3.995     0.999316       596422      1462.86
       4.077     0.999414       596480      1706.67
       4.227     0.999512       596538      2048.00
       4.307     0.999561       596567      2275.56
       4.387     0.999609       596596      2560.00
       4.507     0.999658       596626      2925.71
       4.603     0.999707       596656      3413.33
       4.687     0.999756       596684      4096.00
       4.739     0.999780       596698      4551.11
       4.815     0.999805       596713      5120.00
       4.895     0.999829       596728      5851.43
       4.975     0.999854       596743      6826.67
       5.103     0.999878       596757      8192.00
       5.139     0.999890       596764      9102.22
       5.227     0.999902       596771     10240.00
       5.259     0.999915       596779     11702.86
       5.339     0.999927       596786     13653.33
       5.379     0.999939       596793     16384.00
       5.483     0.999945       596797     18204.44
       5.511     0.999951       596800     20480.00
       5.571     0.999957       596804     23405.71
       5.651     0.999963       596808     27306.67
       5.675     0.999969       596811     32768.00
       5.699     0.999973       596813     36408.89
       5.855     0.999976       596815     40960.00
       6.027     0.999979       596818     46811.43
       6.047     0.999982       596819     54613.33
       6.135     0.999985       596820     65536.00
       6.151     0.999986       596821     72817.78
       6.179     0.999988       596822     81920.00
       6.327     0.999989       596823     93622.86
       6.967     0.999991       596824    109226.67
       7.019     0.999992       596826    131072.00
       7.019     0.999993       596826    145635.56
       7.019     0.999994       596826    163840.00
       7.019     0.999995       596826    187245.71
       7.271     0.999995       596827    218453.33
       7.271     0.999996       596827    262144.00
       7.271     0.999997       596827    291271.11
       7.343     0.999997       596828    327680.00
       7.343     0.999997       596828    374491.43
       7.343     0.999998       596828    436906.67
       7.343     0.999998       596828    524288.00
       7.343     0.999998       596828    582542.22
       7.835     0.999998       596829    655360.00
       7.835     1.000000       596829          inf
#[Mean    =        0.946, StdDeviation   =        0.461]
#[Max     =        7.832, Total count    =       596829]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  795213 requests in 40.01s, 288.18MB read
Requests/sec:  19873.59
Transfer/sec:      7.20MB