benchmark/go-frameworks/results/20260924-102750/results/get/stdlib/r2/60000.txt
Running 40s test @ http://10.128.0.4:8081/api/devices
  16 threads and 512 connections
  Thread calibration: mean lat.: 1.082ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.079ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.071ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.074ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.084ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.072ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.074ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.076ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.067ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.066ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.232ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.073ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.073ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.074ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.101ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.086ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.09ms  646.37us  13.02ms   79.02%
    Req/Sec     3.96k   449.80     7.11k    80.20%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.02ms
 75.000%    1.37ms
 90.000%    1.71ms
 99.000%    3.60ms
 99.900%    5.93ms
 99.990%    7.95ms
 99.999%   10.30ms
100.000%   13.03ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.092     0.000000            1         1.00
       0.414     0.100000       180002         1.11
       0.583     0.200000       358164         1.25
       0.737     0.300000       537333         1.43
       0.881     0.400000       716969         1.67
       1.017     0.500000       895567         2.00
       1.085     0.550000       985313         2.22
       1.153     0.600000      1075157         2.50
       1.222     0.650000      1163744         2.86
       1.294     0.700000      1253506         3.33
       1.369     0.750000      1343467         4.00
       1.408     0.775000      1387711         4.44
       1.451     0.800000      1432426         5.00
       1.500     0.825000      1477610         5.71
       1.557     0.850000      1522123         6.67
       1.626     0.875000      1566776         8.00
       1.667     0.887500      1589185         8.89
       1.714     0.900000      1611576        10.00
       1.769     0.912500      1633745        11.43
       1.836     0.925000      1656320        13.33
       1.920     0.937500      1678495        16.00
       1.975     0.943750      1689706        17.78
       2.041     0.950000      1700833        20.00
       2.125     0.956250      1711953        22.86
       2.243     0.962500      1723196        26.67
       2.415     0.968750      1734383        32.00
       2.525     0.971875      1739960        35.56
       2.651     0.975000      1745533        40.00
       2.791     0.978125      1751132        45.71
       2.953     0.981250      1756714        53.33
       3.143     0.984375      1762330        64.00
       3.255     0.985938      1765146        71.11
       3.373     0.987500      1767895        80.00
       3.507     0.989062      1770718        91.43
       3.661     0.990625      1773497       106.67
       3.851     0.992188      1776284       128.00
       3.961     0.992969      1777683       142.22
       4.085     0.993750      1779089       160.00
       4.231     0.994531      1780513       182.86
       4.391     0.995313      1781880       213.33
       4.587     0.996094      1783300       256.00
       4.699     0.996484      1783984       284.44
       4.831     0.996875      1784684       320.00
       4.975     0.997266      1785396       365.71
       5.131     0.997656      1786079       426.67
       5.311     0.998047      1786775       512.00
       5.419     0.998242      1787130       568.89
       5.527     0.998437      1787484       640.00
       5.643     0.998633      1787828       731.43
       5.787     0.998828      1788178       853.33
       5.955     0.999023      1788523      1024.00
       6.043     0.999121      1788700      1137.78
       6.151     0.999219      1788874      1280.00
       6.283     0.999316      1789045      1462.86
       6.419     0.999414      1789225      1706.67
       6.587     0.999512      1789396      2048.00
       6.675     0.999561      1789483      2275.56
       6.767     0.999609      1789569      2560.00
       6.887     0.999658      1789658      2925.71
       7.015     0.999707      1789746      3413.33
       7.167     0.999756      1789831      4096.00
       7.235     0.999780      1789875      4551.11
       7.399     0.999805      1789921      5120.00
       7.519     0.999829      1789964      5851.43
       7.643     0.999854      1790009      6826.67
       7.791     0.999878      1790050      8192.00
       7.875     0.999890      1790072      9102.22
       7.967     0.999902      1790094     10240.00
       8.083     0.999915      1790116     11702.86
       8.247     0.999927      1790138     13653.33
       8.479     0.999939      1790160     16384.00
       8.567     0.999945      1790170     18204.44
       8.671     0.999951      1790182     20480.00
       8.711     0.999957      1790192     23405.71
       8.903     0.999963      1790203     27306.67
       9.263     0.999969      1790214     32768.00
       9.295     0.999973      1790219     36408.89
       9.423     0.999976      1790225     40960.00
       9.671     0.999979      1790230     46811.43
       9.735     0.999982      1790236     54613.33
      10.039     0.999985      1790242     65536.00
      10.127     0.999986      1790244     72817.78
      10.183     0.999988      1790247     81920.00
      10.295     0.999989      1790249     93622.86
      10.399     0.999991      1790252    109226.67
      10.527     0.999992      1790255    131072.00
      10.703     0.999993      1790256    145635.56
      10.871     0.999994      1790258    163840.00
      10.975     0.999995      1790259    187245.71
      11.183     0.999995      1790260    218453.33
      11.767     0.999996      1790262    262144.00
      11.767     0.999997      1790262    291271.11
      12.071     0.999997      1790263    327680.00
      12.295     0.999997      1790264    374491.43
      12.295     0.999998      1790264    436906.67
      12.343     0.999998      1790265    524288.00
      12.343     0.999998      1790265    582542.22
      12.471     0.999998      1790266    655360.00
      12.471     0.999999      1790266    748982.86
      12.471     0.999999      1790266    873813.33
      12.567     0.999999      1790267   1048576.00
      12.567     0.999999      1790267   1165084.44
      12.567     0.999999      1790267   1310720.00
      12.567     0.999999      1790267   1497965.71
      12.567     0.999999      1790267   1747626.67
      13.031     1.000000      1790268   2097152.00
      13.031     1.000000      1790268          inf
#[Mean    =        1.088, StdDeviation   =        0.646]
#[Max     =       13.024, Total count    =      1790268]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2388441 requests in 40.00s, 865.56MB read
Requests/sec:  59714.97
Transfer/sec:     21.64MB